import { SECONDARYNAV } from "@constants/constants";
import { SecondaryNav } from "@components/Navigations/SecondaryNav/SecondaryNav";
import "./Privacy.css";

export function Privacy() {
  return (
    <section className="privacy">
      <div className="container">
        <div className="privacy__wrapper">
          <SecondaryNav buttons={SECONDARYNAV.privacyPersonalNav} />
          <h2 className="title--2">
            УСЛОВИЯ ПРОДАЖИ ЧЕРЕЗ ИНТЕРНЕТ-САЙТ eda54.ru
          </h2>
          <p className="text">
            Настоящие Условия продажи через интернет-сайт (далее – «Условия»)
            устанавливают существенные условия оказания услуг по изготовлению и
            реализации продукции общественного питания и других товаров, в т.ч.
            пищевых продуктов промышленного изготовления, (далее – «Товар»), под
            торговой маркой Еда54 на территории г. Симферополь.
          </p>
          <p className="text">
            Условия являются публичной офертой - предложением о заключении
            Договора розничной купли-продажи товаров и оказания услуг
            общественного питания и их доставки Продавцом Покупателю.
            Покупатель, ознакомившись с настоящими Условиями, присоединяется к
            ним и выражает свое согласие с ними путем совершения действий,
            указанных в настоящих Условиях.
          </p>
          <p className="text">
            На сайте предоставлена информация об основных потребительских
            свойствах Товара, об адресе (месте нахождения) продавца, о месте
            изготовления товара, о полном фирменном наименовании (наименовании)
            продавца (изготовителя), о цене и об условиях приобретения товара, о
            его доставке, о порядке оплаты товара, сроке годности, а также о
            сроке, в течение которого действует предложение о заключении
            Договора.
          </p>
          <h3 className="title--3">Термины</h3>
          <p className="text">
            Покупатель – физическое лицо, имеющее намерение заказать или
            заказывающее Товар на сайте eda54.ru, использующее услуги
            общественного питания исключительно для личных, семейных, домашних и
            иных нужд, не связанных с осуществлением предпринимательской
            деятельности и согласившееся на приобретение товаров и оказание
            услуг общественного питания в соответствии с настоящими Условиями.
          </p>
          <p className="text">
            Товар – продукция в соответствии с ассортиментом, представленным на
            Интернет-сайте Продавца по адресу: eda54.ru;
          </p>
          <p className="text">
            Заказ – отдельные позиции (позиция) из ассортиментного перечня
            Товаров, выбранные и заказанные Покупателем на сайте Продавца, либо
            по телефонам, указанным на Сайте и оформленные на доставку по
            указанному Покупателем адресу;
          </p>
          <p className="text">Сайт – интернет-сайт Продавца eda54.ru;</p>
          <p className="text">
            Служба доставки – сотрудники Продавца либо представители Продавца,
            осуществляющие доставку Товаров Покупателю.
          </p>
        </div>
      </div>
    </section>
  );
}
